# Books (Core)

Student Name: Nian

## ERD

![png](BooksERD.png)

## Setup

In [1]:
#Imports
import pandas as pd

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Database Connection
username = 'root'
password = '7m7z1P2ss'
dbname = 'Books'

conn_str = f'mysql+pymysql://{username}:{password}@localhost/{dbname}'
conn = create_engine(conn_str)

In [3]:
if not database_exists(conn_str):
    create_database(conn_str)
    print("Database Created")

In [4]:
spreadsheets = {
    'users':'Data/users.csv',
    'authors':'Data/authors.csv',
    'books':'Data/books.csv',
    'favorites':'Data/favorites.csv',
}

In [5]:
# Display Create each table in spreadsheets dict
for name, path in spreadsheets.items():
    df = pd.read_csv(path)
    print(name, df.head(), sep='\n')
    print()                               # Blank line for visibility
    
    df.to_sql(name, conn, if_exists='replace')

users
   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

authors
   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

books
   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

favorites
   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [6]:
sql = "SHOW TABLES;"
pd.read_sql(sql, conn)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [7]:
# and for fun, select all tables :D
for name in spreadsheets.keys():
    print(name, pd.read_sql(f"SELECT * FROM {name}", conn), sep='\n')
    print()

users
   index  id first_name  last_name                 email
0      0   1       John        Doe          JD@books.com
1      1   2      Robin      Smith       Robin@books.com
2      2   3     Gloria  Rodriguez  grodriquez@books.com

authors
   index  id        author_name
0      0   1       Stephen King
1      1   2  F.Scott Fitgerald
2      2   3        Jack London
3      3   4        Jane Austen
4      4   5       Mary Shelley

books
   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

favorites
   index  user_id  book_id
0      0        1        1
1      1        1        2
2      2        1        3
3      3        2        4
4      4        2        5
5      5        3        5
6      6        3        6

In [13]:
sql = """
SELECT u.id as user_id, u.first_name, u.last_name, b.title
FROM books b 
JOIN favorites f ON b.id = f.book_id 
JOIN users u ON u.id = f.user_id 
WHERE u.first_name = "John" AND u.last_name = "Doe";
"""

pd.read_sql(sql, conn)

   user_id first_name last_name             title
0        1       John       Doe       The Shining
1        1       John       Doe                It
2        1       John       Doe  The Great Gatsby